In [200]:
#import pandas, load in as shorthand so we can use it easier- don't have to write pandas every time
import pandas as pd

In [201]:
#load in data from csv files
df_test = pd.read_csv('test_data.csv')
df_students = pd.read_csv('students.csv')
df_sites = pd.read_csv('sites.csv')

In [202]:
#print first 5 rows of the test DataFrame
df_test.head()

    test_date     last_name   first_name  score                  school_name
0  2017-10-01          Asis  Atif Sifiso      1  Hamilton Senior High School
1  2017-10-01      Savatier         Jaga      3  Hamilton Senior High School
2  2017-10-01         Wruck      Arnfinn      3  Hamilton Senior High School
3  2017-10-01  Venera Kohut      Jolanka      4  Hamilton Senior High School
4  2017-10-01      Benetton       Lorcan      4  Hamilton Senior High School

In [203]:
#print first 5 rows of the students DataFrame
df_students.head()

   student_id     last_name   first_name  site_id
0           1          Asis  Atif Sifiso        1
1           2      Savatier         Jaga        1
2           3         Wruck      Arnfinn        1
3           4  Venera Kohut      Jolanka        1
4           5      Benetton       Lorcan        1

In [204]:
#print first 5 rows of the sites DataFrame
df_sites.head()

   site_id                          site_name
0        1        Hamilton Senior High School
1        2  James K. Polk Preparatory Academy
2        3     Rutherford B Hayes Junior High
3        4                  FDR Middle School
4        5                     The New School

In [205]:
#merge DataFrames of students and sites together on 'site_id', preserving all unmatched values from both DataFrames
df_students_sites = pd.merge(df_students, df_sites, how='outer', on='site_id')

#print first 5 rows of the merged students and sites DataFrame
df_students_sites.head()

   student_id     last_name   first_name  site_id                    site_name
0           1          Asis  Atif Sifiso        1  Hamilton Senior High School
1           2      Savatier         Jaga        1  Hamilton Senior High School
2           3         Wruck      Arnfinn        1  Hamilton Senior High School
3           4  Venera Kohut      Jolanka        1  Hamilton Senior High School
4           5      Benetton       Lorcan        1  Hamilton Senior High School

In [206]:
#drop the 'site_name' and 'school_name" columns from their respective DataFrames, as they are not necessary in the ultimate CSV
df_students_sites.drop(columns=['site_name'], inplace=True)
df_test.drop(columns=['school_name'], inplace=True)

#merge the DataFrame of students and sites with the test DataFrame, preserving all unmatched values from both DataFrames
df_merged = pd.merge(df_students_sites, df_test, how='outer')

In [207]:
#rename 'score' to 'test_score', as specified in the instructions
df_merged.rename(columns={'score': 'test_score'}, inplace=True)

In [208]:
#removes spaces from last name
df["last_name"] = df["last_name"].str.strip()

#group the DataFrame by 'last_name' and assign the first 'student_id' value in each group to all rows in that group, avoding duplicate student_id values for students with the same last name
df["student_id"] = df.groupby("last_name")["student_id"].transform("first")

#sort the merged DataFrame by 'student_id' from highest to lowest
df_merged.sort_values(by='student_id', ascending=False, inplace=True)

In [209]:
#drop duplicates based on 'student_id' and 'test_score' columns, keeping the first occurrence of each duplicate
df = df_merged.drop_duplicates(subset=["student_id", "test_score"])

#capitalize the first
#  letter of each word in the 'first_name' and 'last_name' columns
df[['last_name', 'first_name']] = df[['last_name', 'first_name']].apply(lambda x: x.str.title())

#print the whole DataFrame
with pd.option_context('display.max_rows', None):
    print(df)

#check how many rows are in the final DataFrame
len(df)

     student_id              last_name           first_name  site_id  \
20        100.0                Badcock            Caitlin R      5.0
92         99.0                Nikolov  Omolara Aishwarya V      5.0
62         98.0               Kendrick             Sostrate      5.0
61         98.0               Kendrick             Sostrate      5.0
84         97.0                  Misra          Flavianus H      5.0
55         96.0               Horsfall              Jenny H      5.0
131        95.0            Stainthorpe              Helen J      5.0
39         94.0                  Dries              Odell G      5.0
143        93.0            Van De Laar             Baxter V      5.0
96         92.0                  Novak            Astridr Z      5.0
78         91.0              Mathieson            Tat'Ana N      5.0
44         90.0                  Fromm             Pravin R      5.0
94         89.0                 Nikula             Klahan T      5.0
59         88.0             Jollenbeck             Rufaro A      5.0
97         87.0            O' Tadhgain           Weronika L      5.0
23         86.0                Bates V          Bruno Burto      5.0
76         85.0       Ma'Edo'C Bukoski       Claudius Ma'El      5.0
34         84.0             Czajkowski              Adwoa J      5.0
138        83.0                   Teke              Yasin J      5.0
123        82.0          Sheehy-Heeney            Adalynn Z      5.0
37         81.0                 Denzil           Christen N      5.0
24         80.0                Bathory           Saewine B.      4.0
32         79.0                  Carey           Nechtan O.      4.0
71         78.0              Lindstrom              Vera Z.      4.0
86         77.0                 Naggia            Harvey P.      4.0
122        76.0                Sharman             Dipak P.      4.0
129        75.0                Stablum           Eveline G.      4.0
105        74.0                 Paulis          Varinius B.      4.0
50         73.0          Hansson Recht           Mickael J.      4.0
111        72.0                Rijnder          Mayamiko D.      4.0
64         71.0                    Kis               Ron N.      4.0
101        70.0                    Ott              Huri T.      4.0
6          69.0                Abello'             Vaast P.      4.0
153        68.0                Wiegand        Dejen Jyotsna      4.0
42         67.0                 Franco           Shiva J.D.      4.0
100        66.0                 Otieno              Hein B.      4.0
65         65.0                  Klaus         Dip Breen J.      4.0
41         64.0                  Filep       Eusebios A. O.      4.0
51         63.0                   Hase            Oyvind U.      4.0
87         62.0               Nedbalek           Camilla E.      4.0
117        61.0              Sarkisian            Caelan A.      4.0
0          60.0        Abe Acquafredda               Margit      3.0
35         59.0                 Dunkel               Ervins      3.0
109        58.0                 Resnik            Rhydderch      3.0
157        57.0                   Zima              Khalifa      3.0
75         56.0                 Mutton               Prasad      3.0
74         55.0                  Mcnee             Stanimir      3.0
4          54.0                   Albu              Goliath      3.0
142        53.0                Ventura                 Usha      3.0
1          52.0                   Adam               Beylke      3.0
5          51.0         Aleksandrov Iv   Tijana Aedelbeorht      3.0
2          50.0               Agnusdei        Mattityahu H.      3.0
133        49.0              Ta:Htinen          Se'Bire Vid      3.0
114        48.0                  Skala         Anita Lucius      3.0
3          47.0           Agostini Jr.                 Liam      3.0
115        46.0             Sniegowski                 Imke      3.0
56         45.0                Josephs               Salomo      3.0
60         44.0                  Kerry             Wandalin      3.0
17         43.0                 Becket             Severina      3.0
156        42.0                   Zaal              Geghard      3.0
102        41.0             Poindexter              Bertilo      3.0
167        40.0      Ferdinand Dickens        Anila Rosella      2.0
192        39.0                  Soler                Ignas      2.0
191        38.0                   Sitz                 Jaak      2.0
181        37.0                  Nejem               Mihail      2.0
195        36.0  Theofylaktos-Steensen                 Oria      2.0
162        35.0                   Arud                Manju      2.0
176        34.0                 Kunkel              Sandeep      2.0
161        33.0                  Aiken            Borghildr      2.0
198        32.0                   Vida               Regana      2.0
197        31.0                Tosetti   Leontius Vlatismil      2.0
164        30.0                Baumann               Deodat      2.0
165        29.0                  Carey                 Line      2.0
170        28.0                  Groos              Seung M      2.0
178        27.0                    Low     Theophile Yakubu      2.0
182        26.0                O'Neill                Danel      2.0
187        25.0                 Rotolo          Pridbjorn L      2.0
194        24.0                Suharto              Suharto      2.0
173        23.0                Jeffery               Noelle      2.0
196        22.0          Tomi Pitts Jr             Marianna      2.0
189        21.0                 Sharma               Jancsi      2.0
21         20.0                Badcock              Caitlyn      1.0
66         19.0           Konstantinov             Lucianus      1.0
67         19.0           Konstantinov             Lucianus      1.0
45         18.0               Gottlieb                Iosef      1.0
53         17.0                 Hickey              Micaela      1.0
52         17.0                 Hickey              Micaela      1.0
146        16.0                Vastagh              Leticia      1.0
152        15.0                 Weeber            Sophocles      1.0
80         14.0              Mcfarland          Jessie Fran      1.0
69         13.0              Krakowski             Victoria      1.0
7          12.0               Abrahams               Rachna      1.0
8          12.0               Abrahams               Rachna      1.0
135        11.0              Tarpinian                Candi      1.0
31         10.0              Blanc Jr.               Tamhas      1.0
49          9.0               Hall Iii         Dixon France      1.0
103         8.0              Palladino              Srec'Ko      1.0
89          7.0            Nikol-Kyles              Marinko      1.0
108         6.0                  Power     Blodwen Eleonora      1.0
28          5.0               Benetton               Lorcan      1.0
147         4.0           Venera Kohut              Jolanka      1.0
155         3.0                  Wruck              Arnfinn      1.0
118         2.0               Savatier                 Jaga      1.0
16          1.0                   Asis          Atif Sifiso      1.0
9           NaN            Acquafredda               Margit      NaN
11          NaN            Agostini Jr                 Liam      NaN
15          NaN                   Asis                 Atif      NaN
26          NaN                Beckett             Severina      NaN

      test_date  test_score
20   2017-10-01           3
92   2017-10-01           4
62   2018-01-09           2
61   2017-10-01           1
84   2017-10-01           3
55   2017-10-01           2
131  2017-10-01           3
39   2017-10-01           3
143  2017-10-01           3
96   2017-10-01           3
78   2017-10-01           4
44   2017-10-01           4
94   2017-10-01           4
59   2017-10-01           4
97   2017-10-01           2
23   2017-10-01           4
76   2017-10-01           4
34   2017-10-01           3
138  2017-10-01           1
123  2017-10-01           1
37   2017-10-01           1
24   2017-10-01           2
32   2017-10-01           2
71   2017-10-01           3
86   2017-10-01           4
122  2017-10-01           2
129  2017-10-01           3
105  2017-10-01           3
50   2017-10-01           3
111  2017-10-01           3
64   2017-10-01           4
101  2017-10-01           1
6    2017-10-01           4
153  2017-10-01           4
42   2017-10-01           1
100  2017-10-01           2
65   2017-10-01           3
41   2017-10-01           4
51   2017-10-01           3
87   2017-10-01           2
117  2017-10-01           1
0    2017-10-01           3
35   2017-10-01           2
109  2017-10-01           4
157  2017-10-01           3
75   2017-10-01           1
74   2017-10-01           3
4    2017-10-01           2
142  2017-10-01           3
1    2017-10-01           1
5    2017-10-01           1
2    2017-10-01           3
133  2017-10-01           3
114  2017-10-01           4
3    2017-10-01           4
115  2017-10-01           4
56   2017-10-01           4
60   2017-10-01           2
17   2017-10-01           2
156  2017-10-01           2
102  2017-10-01           3
167  2017-10-01           4
192  2017-10-01           2
191  2017-10-01           2
181  2017-10-01           3
195  2017-10-01           1
162  2017-10-01           4
176  2017-10-01           2
161  2017-10-01           1
198  2017-10-01           2
197  2017-10-01           3
164  2017-10-01           2
165  2017-10-01           2
170  2017-10-01           3
178  2017-10-01           3
182  2017-10-01           2
187  2017-10-01           2
194  2017-10-01           2
173  2017-10-01           4
196  2017-10-01           1
189  2017-10-01           1
21   2017-10-01           3
66   2017-10-01           2
67   2018-01-09           4
45   2017-10-01           4
53   2018-01-09           2
52   2017-10-01           1
146  2017-10-01           4
152  2017-10-01           3
80   2017-10-01           2
69   2018-01-09           2
7    2017-10-01           3
8    2018-01-09           4
135  2017-10-01           3
31   2017-10-01           1
49   2017-10-01           1
103  2017-10-01           1
89   2017-10-01           4
108  2017-10-01           2
28   2018-01-09           4
147  2017-10-01           4
155  2018-01-09           3
118  2017-10-01           3
16   2017-10-01           1
9    2018-01-09           3
11   2018-01-09           4
15   2018-01-09           2
26   2018-01-09           1

108

In [210]:
#print match counts for each column, showing how many values are not null (i.e. how many matches there are for each column)
print('Match counts: ')
match_counts = df.notna().value_counts()
print( match_counts )

#match rates, which is calculated by dividing match counts by the total number of rows in the DataFrame, to show the proportion of matches for each column
match_rates = match_counts / match_counts.sum()
print( match_rates )

#convert to CSV
df.to_csv('matched_student_data.csv', columns=['student_id', 'test_date', 'test_score'], index=False)

Match counts:
student_id  last_name  first_name  site_id  test_date  test_score
True        True       True        True     True       True          104
False       True       True        False    True       True            4
Name: count, dtype: int64
student_id  last_name  first_name  site_id  test_date  test_score
True        True       True        True     True       True          0.962963
False       True       True        False    True       True          0.037037
Name: count, dtype: float64